CSI API ETABS v1

# cSapModelLinkObj Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cLinkObj LinkObj { get; }

    ReadOnly Property LinkObj As cLinkObj
    	Get

    Dim instance As cSapModel
    Dim value As cLinkObj

    value = instance.LinkObj

    property cLinkObj^ LinkObj {
    	cLinkObj^ get ();
    }

    abstract LinkObj : cLinkObj with get

#### Property Value

Type: cLinkObj

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com